itptest_mb/redis_stream/redis+stream_8/redis_output/redis7779.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
connection dropped.
connection dropped.
connection dropped.
[...]
read error: Connection reset by peer
connection dropped.
connection dropped.
read error: Connection reset by peer
connection dropped.
connection dropped.
connection dropped.
[...]
read error: Connection reset by peer
connection dropped.
connection dropped.
connection dropped.
[...]
read error: Connection reset by peer
read error: Connection reset by peer
connection dropped.
connection dropped.
read error: Connection reset by peer
connection dropped.
read error: Connection reset by peer
connection dropped.
connection dropped.
connection dropped.
[...]
read error: Connection reset by peer
connection dropped.
read error: Connection reset by peer
connection dropped.
connection dropped.
connection dropped.
[...]
read error: Connection reset by peer
connection dropped.
read error: Connection reset by peer
connection dropped.
connection dropped.
connection dropped.
[...]
read error: Connection reset by peer
read error: Connection reset by peer
connection dropped.
connection dropped.
connection dropped.
read error: Connection reset by peer
read error: Connection reset by peer
read error: Connection reset by peer
[...]
connection dropped.
connection dropped.
[RUN #1 11%,  20 secs]  0 threads:    11544540 ops,  594421 (avg:  577177) ops/sec, 592.08MB/sec (avg: 574.47MB/sec),  5.03 (avg:  5.11) msec latency

10        Threads
10        Connections per thread
180       Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets           0.00          ---          ---      5.11700         0.00
Gets           0.00         0.00         0.00      5.11700         0.00
Waits          0.00          ---          ---      0.00000          ---
Totals         0.00         0.00         0.00      5.11700         0.00